In [5]:
import pandas as pd

url = 'https://tinyurl.com/titanic-csv'

dataframe = pd.read_csv(url)

dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

CREATE DATAFRAME

In [2]:
dataframe = pd.DataFrame()

dataframe['col1'] = ['row11','row12','row13']
dataframe['col2'] = ['row21','row22','row23']

dataframe

    col1   col2
0  row11  row21
1  row12  row22
2  row13  row23

INSERTING ROW

In [4]:
new_row = pd.Series(['row14','row24'],index=['col1','col2'])

dataframe.append(new_row, ignore_index=True)

    col1   col2
0  row11  row21
1  row12  row22
2  row13  row23
3  row14  row24

In [6]:
dataframe.tail(5)

                        Name PClass   Age   Sex  Survived  SexCode
1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

In [7]:
dataframe.shape

(1313, 6)

In [8]:
dataframe.size

7878

In [9]:
dataframe.columns

Index(['Name', 'PClass', 'Age', 'Sex', 'Survived', 'SexCode'], dtype='object')

DESCRIBE DATAFRAME

In [11]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

NAVIGATING DATAFRAMES

In [12]:
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [13]:
dataframe.iloc[1:5]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [14]:
dataframe.iloc[10:20]

,Name,PClass,Age,Sex,Survived,SexCode
10,"Astor, Colonel John Jacob",1st,47.0,male,0,0
11,"Astor, Mrs John Jacob (Madeleine Talmadge Force)",1st,19.0,female,1,1
12,"Aubert, Mrs Leontine Pauline",1st,NaN,female,1,1
13,"Barkworth, Mr Algernon H",1st,NaN,male,1,0
14,"Baumann, Mr John D",1st,NaN,male,0,0
15,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.0,female,1,1
16,"Baxter, Mr Quigg Edmond",1st,24.0,male,0,0
17,"Beattie, Mr Thomson",1st,36.0,male,0,0
18,"Beckwith, Mr Richard Leonard",1st,37.0,male,1,0
19,"Beckwith, Mrs Richard Leonard (Sallie Monypeny)",1st,47.0,female,1,1

SETTING THE INDEX

In [15]:
dataframe1 = dataframe.set_index(dataframe['Name'])

In [16]:
dataframe1.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
Name,,,,,,
"Allen, Miss Elisabeth Walton","Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
"Allison, Miss Helen Loraine","Allison, Miss Helen Loraine",1st,2.00,female,0,1
"Allison, Mr Hudson Joshua Creighton","Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
"Allison, Mrs Hudson JC (Bessie Waldo Daniels)","Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
"Allison, Master Hudson Trevor","Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [18]:
dataframe1.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

In [20]:
dataframe.loc[5]

Name        Anderson, Mr Harry
PClass                     1st
Age                         47
Sex                       male
Survived                     1
SexCode                      0
Name: 5, dtype: object

In [21]:
dataframe1.iloc[5]

Name        Anderson, Mr Harry
PClass                     1st
Age                         47
Sex                       male
Survived                     1
SexCode                      0
Name: Anderson, Mr Harry, dtype: object

SELECTING ROWS BASED ON CONDITIONALS

In [22]:
dataframe[dataframe['Sex']=='female'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [23]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [37]:
dataframe[dataframe['Age']<=2.00].head(5)

                              Name PClass   Age     Sex  Survived  SexCode
1      Allison, Miss Helen Loraine    1st  2.00  female         0        1
4    Allison, Master Hudson Trevor    1st  0.92    male         1        0
339       Becker, Master Richard F    2nd  1.00    male         1        0
358   Caldwell, Master Alden Gates    2nd  0.83    male         1        0
425       Hamalainen, Master Viljo    2nd  1.00    male         1        0

In [50]:
dataframe[(dataframe['Age']<=2.00) & (dataframe['Survived']==1)].head(5)

                              Name PClass   Age     Sex  Survived  SexCode
4    Allison, Master Hudson Trevor    1st  0.92    male         1        0
339       Becker, Master Richard F    2nd  1.00    male         1        0
358   Caldwell, Master Alden Gates    2nd  0.83    male         1        0
425       Hamalainen, Master Viljo    2nd  1.00    male         1        0
478           LaRoche, Miss Louise    2nd  1.00  female         1        1

REPLACING VALUES

In [51]:
dataframe['Sex'].replace('female','woman').head(5)

0    woman
1    woman
2     male
3    woman
4     male
Name: Sex, dtype: object

In [52]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

REPLACING MULTIPLE VALUES AT SAME TIME

In [53]:
dataframe.replace(['female','woman'],['male','man']).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,male,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,male,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,male,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

REPLACING OVER ENTIRE DATAFRAME

In [54]:
dataframe.replace(1, 'one').head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29,female,one,one
1,"Allison, Miss Helen Loraine",1st,2,female,0,one
2,"Allison, Mr Hudson Joshua Creighton",1st,30,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25,female,0,one
4,"Allison, Master Hudson Trevor",1st,0.92,male,one,0

In [55]:
dataframe.replace(r'1st','First',regex=True).head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",First,29.00,female,1,1
1,"Allison, Miss Helen Loraine",First,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",First,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",First,25.00,female,0,1
4,"Allison, Master Hudson Trevor",First,0.92,male,1,0

RENAMING COLUMNS

In [56]:
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(5)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [57]:
dataframe.rename(columns={'PClass':'Passenger Class', 'Sex':'Gender'}).head(5)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

FIND MIN, MAX, SUM, AVG & COUNT

In [58]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [60]:
dataframe['Age'].max()

71.0

In [61]:
dataframe['Age'].min()

0.17

In [62]:
dataframe['Age'].sum()

22980.88

In [63]:
dataframe['Age'].count()

756

In [64]:
dataframe['Age'].mean()

30.397989417989415

In [65]:
dataframe['Age'].std()

14.259048710359023

FINDING UNIQUE VALUES

In [67]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [73]:
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [69]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [74]:
dataframe['PClass'].nunique()

4

HANDLING MISSING VALUES

In [75]:
dataframe[dataframe['Age'].isnull()].head(5)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

In [81]:
import numpy as np
dataframe[(dataframe['Age']==np.nan)].head(5)

Empty DataFrame
Columns: [Name, PClass, Age, Sex, Survived, SexCode]
Index: []

DELETING A COLUMN

In [84]:
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [86]:
dataframe.drop(dataframe.columns[0], axis=1).head(2)

  PClass   Age     Sex  Survived  SexCode
0    1st  29.0  female         1        1
1    1st   2.0  female         0        1

In [87]:
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

DELETE ROW

In [88]:
dataframe[dataframe['Sex']!='male'].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1

In [89]:
dataframe[(dataframe['Sex']!='male')&(dataframe['PClass']!='1st')].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
323,"Abelson, Mrs Samuel (Anna)",2nd,28.0,female,1,1
327,"Angle, Mrs William A (Florence)",2nd,32.0,female,1,1
331,"Balls, Mrs Ada E Hall",2nd,36.0,female,1,1
335,"Beane, Mrs Edward (Ethel Clarke)",2nd,19.0,female,1,1
337,"Becker, Mrs Allen Oliver (Nellie E Baumgardner)",2nd,36.0,female,1,1

DROPPING DUPLICATE ROWS

In [90]:
dataframe.drop_duplicates().head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [91]:
print("No of rows in the original dataframe",len(dataframe))
print("No of rows after dropping duplicates",len(dataframe.drop_duplicates()))
# By default if values of all columns are duplicates then only rows will be deleted. We have to mention the 
# subset of the values to consider for droppping duplicates as below

No of rows in the original dataframe 1313
No of rows after dropping duplicates 1313

In [92]:
dataframe.drop_duplicates(subset=['Sex'],keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [93]:
dataframe.drop_duplicates(subset=['Sex'],keep='first')

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

GROUPING ROWS BY VALUES

In [94]:
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [95]:
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [97]:
dataframe.groupby('Survived').std()

                Age   SexCode
Survived
0         13.438604  0.383111
1         15.307481  0.465254

In [103]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [104]:
dataframe.groupby(['Sex','Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

In [105]:
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [107]:
dataframe.groupby(['PClass','Sex'])['Age'].count()

PClass  Sex
*       male        0
1st     female    101
        male      125
2nd     female     85
        male      127
3rd     female    102
        male      216
Name: Age, dtype: int64

LOOPING OVER COLUMNS

In [111]:
for name in dataframe['Name'][0:5]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON
ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
ALLISON, MASTER HUDSON TREVOR

APPLYING FUNCTION OVER ALL ELEMENTS IN A COLUMN

In [114]:
def uppercase(x):
    return x.upper()

dataframe['Name'].apply(uppercase)[0:5]

0                     ALLEN, MISS ELISABETH WALTON
1                      ALLISON, MISS HELEN LORAINE
2              ALLISON, MR HUDSON JOSHUA CREIGHTON
3    ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
4                    ALLISON, MASTER HUDSON TREVOR
Name: Name, dtype: object

APPLY FUNCTIONS TO GROUPS

In [115]:
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851